[
	{
		"display": true,
		"id": "mips",
		"title": "MIPS emulator",
		"summary": "MIPS este o arhitectură de procesor foarte scalabilă care utilizează setul de instrucțiuni RISC. Aplicația are rolul de a simula un astfel de procesor, rulând cod mașină direct în browser. După ce a fost încărcat și compilat codul din limbaj de asamblare în instrucțiuni binare, poate fi urmărită executarea lui pas cu pas.",
		"link": "https://bodi-cmd.github.io/mips-simulator/",
		"image": "./renders/procesor.webp",
		"tags": ["JS", "Computer Arhitecture"],
		"date": "Iunie 2022"
	},
	{
		"display": true,
		"id": "teams_clone",
		"title": "Megasoft Groups",
		"summary": "În prezent, tot mai multe companii, dar și instituții de învățământ au recurs la soluții de comunicare online. Megasoft Groups este o aplicație similară cu Microsoft Teams, unde utilizatorii pot crea și evalua taskuri, încărca fișiere și comunica cu alte persoane în timp real.",
		"link": "https://ms-groups.herokuapp.com/",
		"image": "./renders/teams.webp",
		"tags": ["JS", "SCSS", "React", "Java", "Springboot", "MySQL"],
		"date": "Decembrie 2022"
	},
	{
		"display": true,
		"id": "auto_chess",
		"title": "AutoChess",
		"summary": "AutoChess este o platformă inovatoare ce aduce la viață o tablă de șah robotizată, capabilă să simuleze un adversar real. Proiectul integrează electronică, programare și mecanică pentru a oferi o experiență interactivă, demonstrând aplicarea practică a tehnologiilor embedded și a prototipării rapide.",
		"link": "",
		"image": "./renders/sah0000.webp",
		"tags": ["C", "Arduino", "Python", "3D Printing", "Embedded"],
		"date": "Mai 2019"
	},
	{
		"display": false,
		"id": "AES",
		"title": "AES Encryption",
		"summary": "<i>Advanced Encryption Standard</i> reprezinta standardul de cryptare la nivel mondial. Algoritmul grupeaza datele in blocuri de 128 de biți, apoi aplica operații matematice pe inelul GF(2^8), precum interschimbarea valorilor, permutarea liniilor, înmulțirea cu matrici, dar si operația logica sau exclusiv (<i> XOR </i>).",
		"link": "",
		"image": "./renders/laptop_aes.webp",
		"tags": ["C/C++"],
		"date": "Iulie 2021"
	},
	{
		"display": false,
		"id": "the_hunter_master",
		"title": "The Hunter Master!",
		"summary": "<i>The Hunter Master!</i> este un joc destinat telefoanelor cu Android. Scopul jocului este acela de a vâna eficient cât mai multe animale, astfel colectând bani îmbunătățind cât mai multe bonusuri.",
		"link": "",
		"image": "./renders/thehuntermaster.webp",
		"tags": ["C#", "Unity"],
		"date": "Iulie 2018"
	},
	{
		"display": false,
		"id": "medapp",
		"title": "MedApp",
		"summary": "Majoritatea oamenilor sufera de afecțiuni care îi supun la anumite tratamente. Dar ce te faci în cazul în care ai nevoie de un medicament de la farmacie, iar tu nu te poți deplasa deoarece te aflii în carantina la domiciuliu. Proiectul <i>MedApp</i> are ca scop realizarea conexiunii intre pacienți medici si curieri. Îți descrii simptomele online, unui medic, apoi primești rețeta pe care o poți comanda la tine acasă direct din aplicație.",
		"link": "",
		"image": "./renders/laptop_medapp.webp",
		"tags": ["NodeJS", "SQL", "Bcrypt", "PassportAuth", "Express", "ejs"],
		"date": "Noiembrie 2020"
	},
	{
		"display": false,
		"id": "chain_up",
		"title": "Chain Up!",
		"summary": "Stivuiește cât mai multe cutii fără să le scapi. Pare simplu? Doar încearcă! <i>Chain Up!</i> este un joc realizat pentru platforma Android, ce plănuiește sa îți puna reflexele la încercare.",
		"link": "",
		"image": "./renders/chainup.webp",
		"tags": ["C#", "Unity"],
		"date": "Aprilie 2018"
	},
	{
		"display": false,
		"id": "wall_breaker",
		"title": "Wall Breaker",
		"summary": "Îți plac jocurile de tip infinite runner? Atunci <i>Wall Breaker</i> este exact ce căutai. Sparge unul dintre cele patru blocuri ale zidurilor pentru a face loc cometei să treacă. Adună puncte si deblochează toate culorile disponibile.",
		"link": "",
		"image": "./renders/wallbreaker.webp",
		"tags": ["C#", "Unity"],
		"date": "Decembrie 2017"
	}
]
