{
  "healthyc": {
    "title": "HLTC",
    "subtitle": "takes care of your lungs by limiting the amount of cigarettes",
    "intro1": "The tobacco epidemic is one of the biggest public health threats the world has ever faced, killing more than 8 million people every year.",
    "intro2": "To help address this problem, I decided to build this device. HLTC is a smart cigarette pack designed to help you quit smoking. The main principle of this device is to dose the number of cigarettes you can take over time. After each cigarette, you have to wait a certain amount of time, which increases gradually with each cigarette you take.",
    "intro3": "One of the most complex components of this project was the case. I tried to make it portable, but still give it a large battery, which can last for weeks, and enough storage for cigarettes (around 20 pcs). We will talk about the other components later.",
    "started": "Project Started On:",
    "started_date": "14 Oct 2018",
    "ended": "Project Ended On:",
    "ended_date": "25 Feb 2020",
    "costs": "Project Production Costs:",
    "costs_value": "~$15",
    "difficulty": "Difficulty level:",
    "difficulty_value": "Medium",
    "components": "Components",
    "component_arduino": "Arduino Nano",
    "component_rtc": "RTC DS3231",
    "component_mpu": "MPU6050",
    "component_ir": "IR Interrupting Sensor",
    "component_oled": "OLED 0.96\" I2C",
    "component_battery": "Li_Ion Battery",
    "component_usb": "USB Module",
    "component_switches": "Switches and Push Buttons",
    "component_enclosure": "Enclosure",
    "casing_title": "The Casing",
    "casing_text": "As I mentioned, the case was very hard to design. I modeled it in Creo Parametric, and then 3D printed it with a ZORTRAX M200 printer.",
    "powering_title": "Powering",
    "powering_text": "For power, I used a Li-Ion battery salvaged from an old smartphone. I chose it because it's lightweight, thin, and has a lot of charge (1800mAh). The nominal voltage of this battery is 3.7V, so I had to use a step-up boost converter to raise the voltage to 5V. For charging the battery, I needed a step-down converter. Luckily, I found a USB power bank circuit, which has both step-up and step-down converters for a low price. Now we can use the pack as a portable power bank too!",
    "motherboard_title": "The Motherboard",
    "motherboard_text": "The brain of this project is an Arduino Nano. It is connected to a gyroscope for detecting the user's steps, and also to an RTC (Real Time Clock) for keeping the exact time, even if the device is powered off. The pack is unlocked by a 9g servomotor with the help of an IR interrupting sensor, which detects when a cigarette is taken and tells the 'brain' to lock it again. All the information is shown on an OLED display, using I2C communication for easy connection. I made all the components detachable, so I can reuse them for other projects.",
    "assembling_title": "Assembling",
    "assembling_text": "Luckily, the case was perfect on the first try, so the assembly was easy."
  }
}
