{
  "healthyc": {
    "title": "HLTC",
    "subtitle": "are grijă de plămânii tăi limitând numărul de țigări",
    "intro1": "Epidemia de tutun este una dintre cele mai mari amenințări la adresa sănătății publice din lume, ucigând peste 8 milioane de oameni în fiecare an.",
    "intro2": "Pentru a ajuta la rezolvarea acestei probleme, am decis să construiesc acest dispozitiv. HLTC este un pachet inteligent de țigări conceput pentru a te ajuta să te lași de fumat. Principiul de bază al acestui dispozitiv este dozarea numărului de țigări pe care le poți lua într-o anumită perioadă de timp. După fiecare țigară, trebuie să aștepți o anumită perioadă, care crește treptat cu fiecare țigară fumată.",
    "intro3": "Una dintre cele mai complexe componente ale acestui proiect a fost carcasa. Am încercat să o fac portabilă, dar să aibă și o baterie mare, care să țină săptămâni întregi, și suficient spațiu pentru țigări (aproximativ 20 bucăți). Vom vorbi despre celelalte componente mai târziu.",
    "started": "Proiect început la:",
    "started_date": "14 oct 2018",
    "ended": "Proiect finalizat la:",
    "ended_date": "25 feb 2020",
    "costs": "Costuri de producție:",
    "costs_value": "~15$",
    "difficulty": "Nivel de dificultate:",
    "difficulty_value": "Mediu",
    "components": "Componente",
    "component_arduino": "Arduino Nano",
    "component_rtc": "RTC DS3231",
    "component_mpu": "MPU6050",
    "component_ir": "Senzor IR de întrerupere",
    "component_oled": "OLED 0.96\" I2C",
    "component_battery": "Baterie Li-Ion",
    "component_usb": "Modul USB",
    "component_switches": "Comutatoare și butoane",
    "component_enclosure": "Carcasă",
    "casing_title": "Carcasa",
    "casing_text": "Așa cum am menționat, carcasa a fost foarte greu de proiectat. Am modelat-o în Creo Parametric și apoi am printat-o 3D cu o imprimantă ZORTRAX M200.",
    "powering_title": "Alimentare",
    "powering_text": "Pentru alimentare am folosit o baterie Li-Ion recuperată dintr-un smartphone vechi. Am ales-o pentru că este ușoară, subțire și are o capacitate mare (1800mAh). Tensiunea nominală a acestei baterii este de 3.7V, așa că a trebuit să folosesc un convertor step-up pentru a ridica tensiunea la 5V. Pentru încărcare, am avut nevoie de un convertor step-down. Din fericire, am găsit un circuit de power bank USB, care are ambele convertoare la un preț mic. Acum putem folosi pachetul și ca power bank portabil!",
    "motherboard_title": "Placa de bază",
    "motherboard_text": "Creierul acestui proiect este un Arduino Nano. Este conectat la un giroscop pentru detectarea pașilor utilizatorului și la un RTC (ceas în timp real) pentru a păstra ora exactă, chiar dacă dispozitivul este oprit. Pachetul este deblocat de un servomotor de 9g cu ajutorul unui senzor IR de întrerupere, care detectează când este luată o țigară și spune 'creierului' să îl blocheze din nou. Toate informațiile sunt afișate pe un display OLED, folosind comunicația I2C pentru conectare ușoară. Am făcut toate componentele detașabile, astfel încât să le pot reutiliza pentru alte proiecte.",
    "assembling_title": "Asamblare",
    "assembling_text": "Din fericire, carcasa a ieșit perfect din prima încercare, așa că asamblarea a fost ușoară."
  }
}
